## production: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                              NAME                              |
|----------|----------------------------------------------------------------|
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]`              |
| add      | `aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]` |
|          | `aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]`   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
17:45:06.153 STDOUT terraform:   + create
17:45:06.153 STDOUT terraform: -/+ destroy and then create replacement
17:45:06.153 STDOUT terraform: Terraform will perform the following actions:
17:45:06.153 STDOUT terraform:   # aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0] will be created
17:45:06.153 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "api-gateway-5xx-error-warning" {
17:45:06.153 STDOUT terraform:       + actions_enabled                       = true
17:45:06.153 STDOUT terraform:       + alarm_actions                         = [
17:45:06.153 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
17:45:06.153 STDOUT terraform:         ]
17:45:06.153 STDOUT terraform:       + alarm_description                     = "API Gateway is returning 5XX errors"
17:45:06.153 STDOUT terraform:       + alarm_name                            = "api-gateway-5xx-error-warning"
17:45:06.153 STDOUT terraform:       + arn                                   = (known after apply)
17:45:06.153 STDOUT terraform:       + comparison_operator                   = "GreaterThanThreshold"
17:45:06.153 STDOUT terraform:       + dimensions                            = {
17:45:06.154 STDOUT terraform:           + "ApiName" = "api-lambda"
17:45:06.154 STDOUT terraform:           + "Stage"   = "v1"
17:45:06.154 STDOUT terraform:         }
17:45:06.154 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:45:06.154 STDOUT terraform:       + evaluation_periods                    = 1
17:45:06.154 STDOUT terraform:       + id                                    = (known after apply)
17:45:06.154 STDOUT terraform:       + insufficient_data_actions             = [
17:45:06.154 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
17:45:06.154 STDOUT terraform:         ]
17:45:06.154 STDOUT terraform:       + metric_name                           = "5XXError"
17:45:06.154 STDOUT terraform:       + namespace                             = "AWS/ApiGateway"
17:45:06.154 STDOUT terraform:       + ok_actions                            = [
17:45:06.154 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
17:45:06.154 STDOUT terraform:         ]
17:45:06.154 STDOUT terraform:       + period                                = 60
17:45:06.154 STDOUT terraform:       + region                                = "ca-central-1"
17:45:06.154 STDOUT terraform:       + statistic                             = "Sum"
17:45:06.154 STDOUT terraform:       + tags_all                              = (known after apply)
17:45:06.154 STDOUT terraform:       + threshold                             = 0
17:45:06.154 STDOUT terraform:       + treat_missing_data                    = "notBreaching"
17:45:06.154 STDOUT terraform:     }
17:45:06.154 STDOUT terraform:   # aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0] will be created
17:45:06.154 STDOUT terraform:   + resource "aws_cloudwatch_metric_alarm" "lambda-api-throttle-warning" {
17:45:06.154 STDOUT terraform:       + actions_enabled                       = true
17:45:06.154 STDOUT terraform:       + alarm_actions                         = [
17:45:06.154 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
17:45:06.155 STDOUT terraform:         ]
17:45:06.155 STDOUT terraform:       + alarm_description                     = "API Lambda function is being throttled"
17:45:06.155 STDOUT terraform:       + alarm_name                            = "lambda-api-throttle-warning"
17:45:06.155 STDOUT terraform:       + arn                                   = (known after apply)
17:45:06.155 STDOUT terraform:       + comparison_operator                   = "GreaterThanThreshold"
17:45:06.155 STDOUT terraform:       + dimensions                            = {
17:45:06.155 STDOUT terraform:           + "FunctionName" = "api-lambda"
17:45:06.155 STDOUT terraform:         }
17:45:06.155 STDOUT terraform:       + evaluate_low_sample_count_percentiles = (known after apply)
17:45:06.155 STDOUT terraform:       + evaluation_periods                    = 1
17:45:06.155 STDOUT terraform:       + id                                    = (known after apply)
17:45:06.155 STDOUT terraform:       + insufficient_data_actions             = [
17:45:06.155 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
17:45:06.155 STDOUT terraform:         ]
17:45:06.155 STDOUT terraform:       + metric_name                           = "Throttles"
17:45:06.155 STDOUT terraform:       + namespace                             = "AWS/Lambda"
17:45:06.155 STDOUT terraform:       + ok_actions                            = [
17:45:06.155 STDOUT terraform:           + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
17:45:06.155 STDOUT terraform:         ]
17:45:06.155 STDOUT terraform:       + period                                = 60
17:45:06.155 STDOUT terraform:       + region                                = "ca-central-1"
17:45:06.155 STDOUT terraform:       + statistic                             = "Sum"
17:45:06.155 STDOUT terraform:       + tags_all                              = (known after apply)
17:45:06.155 STDOUT terraform:       + threshold                             = 0
17:45:06.155 STDOUT terraform:       + treat_missing_data                    = "notBreaching"
17:45:06.156 STDOUT terraform:     }
17:45:06.156 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
17:45:06.156 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
17:45:06.156 STDOUT terraform:       ~ id       = "8091547222012215943" -> (known after apply)
17:45:06.156 STDOUT terraform:       ~ triggers = { # forces replacement
17:45:06.156 STDOUT terraform:           ~ "always_run" = "2025-08-21T15:01:53Z" -> (known after apply)
17:45:06.156 STDOUT terraform:         }
17:45:06.156 STDOUT terraform:     }
17:45:06.156 STDOUT terraform: Plan: 3 to add, 0 to change, 1 to destroy.
17:45:06.156 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
17:45:06.156 STDOUT terraform: Saved the plan to: plan.tfplan
17:45:06.156 STDOUT terraform: To perform exactly these actions, run the following command to apply:
17:45:06.156 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-5xx-error-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.lambda-api-throttle-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
